IDENTIFICATION DIVISION.
PROGRAM-ID. DB2FETCH.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-CUST-ID         PIC 9(5).
01  WS-CUST-NAME       PIC X(30).

EXEC SQL
    DECLARE CUSTCURSOR CURSOR FOR
    SELECT CUSTOMER_NAME FROM CUSTOMERS WHERE CUSTOMER_ID = :WS-CUST-ID
END-EXEC.

PROCEDURE DIVISION.
    DISPLAY "Enter Customer ID: ".
    ACCEPT WS-CUST-ID.

    EXEC SQL
        OPEN CUSTCURSOR
    END-EXEC.

    EXEC SQL
        FETCH CUSTCURSOR INTO :WS-CUST-NAME
    END-EXEC.

    IF SQLCODE = 0 THEN
        DISPLAY "Customer Name: " WS-CUST-NAME
    ELSE
        DISPLAY "Customer Not Found"
    END-IF.

    EXEC SQL
        CLOSE CUSTCURSOR
    END-EXEC.

    STOP RUN.
